In [1]:
import pandas as pd
import numpy as np

In [2]:
produtos = pd.read_csv('product_info.csv', sep=';')
compras = pd.read_csv('purchase.csv')
clientes = pd.read_csv('user_profile.csv', sep='|')

In [3]:
df = clientes.merge(compras, on='User_ID', how='outer')
df.head(3)

,User_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_ID,Purchase
0,1000001,F,0-17,10,A,2,0,P00069042,8370
1,1000001,F,0-17,10,A,2,0,P00248942,15200
2,1000001,F,0-17,10,A,2,0,P00087842,1422

In [4]:
df = df.merge(produtos, on='Product_ID', how='outer')
df.head(3)

,User_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_ID,Purchase,Product_Category_1,Product_Category_2,Product_Category_3
0,1000001,F,0-17,10,A,2,0,P00069042,8370,3,NaN,NaN
1,1000017,M,51-55,1,C,0,0,P00069042,13591,3,NaN,NaN
2,1000023,M,36-45,0,B,3,1,P00069042,11022,3,NaN,NaN

In [5]:
df.to_csv('DF')

## Questão 1
Quantas observações e quantas colunas há no dataset completo (todas as bases juntas)? Responda no formato de uma tuple (n_observacoes, n_colunas).

In [6]:
df.shape

(537577, 12)



## Questão 2
Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [7]:
filtro = df[(df['Gender'] == 'F') & (df['Age'] == '26-35')]
filtro['User_ID'].nunique()

545

## Questão 3
Quantos usuários únicos há no dataset? Responda como um único escalar.

In [8]:
df['User_ID'].nunique()

5891

## Questão 4
Qual porcentagem dos registros (percentual de linhas) possui ao menos um valor null (None, ǸaN etc)? Responda como um único escalar entre 0 e 1.

In [9]:
round((1 - (df.dropna().shape[0]) / df.shape[0]), 3)

0.694

## Questão 5
Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [10]:
df.isnull().sum().max()

373299

## Questão 6
Qual o valor mais frequente (sem contar nulls) em Product_Category_3? Responda como um único escalar.

In [11]:
df['Product_Category_3'].value_counts().index[0]

16.0

## Questão 7
Podemos afirmar que se uma observação é null em Product_Category_2 ela também o é em Product_Category_3? Responda com um bool (True, False).

In [12]:
df.head(3)

,User_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_ID,Purchase,Product_Category_1,Product_Category_2,Product_Category_3
0,1000001,F,0-17,10,A,2,0,P00069042,8370,3,NaN,NaN
1,1000017,M,51-55,1,C,0,0,P00069042,13591,3,NaN,NaN
2,1000023,M,36-45,0,B,3,1,P00069042,11022,3,NaN,NaN

In [13]:
df.isnull().sum()

User_ID                            0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_ID                         0
Purchase                           0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
dtype: int64

## Questão 8
Qual o ID do usuário que mais gastou na Black Friday?

In [14]:
users_compras = df.groupby(by=['User_ID'])['Purchase'].sum()
users_compras.idxmax()

1004277

## Questão 9

Qual grupo (homens ou mulheres) mais gastou na Black Friday?

In [15]:
df.head(3)

,User_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_ID,Purchase,Product_Category_1,Product_Category_2,Product_Category_3
0,1000001,F,0-17,10,A,2,0,P00069042,8370,3,NaN,NaN
1,1000017,M,51-55,1,C,0,0,P00069042,13591,3,NaN,NaN
2,1000023,M,36-45,0,B,3,1,P00069042,11022,3,NaN,NaN

In [16]:
df.groupby(by=['Gender'])['Purchase'].sum()

Gender
F    1164624021
M    3853044357
Name: Purchase, dtype: int64

## Questão 10

Faça uma nova tabela com a categoria mais comprada por cada cliente.

Obs: se ele comprou um produto que possuir valores nas três colunas de categorias, então deve-se considerar todas as categorias.

In [28]:
df2 = df[['User_ID', 'Product_Category_1', 'Product_Category_2', 'Product_Category_3']]
df2.head(3)

   User_ID  Product_Category_1  Product_Category_2  Product_Category_3
0  1000001                   3                 NaN                 NaN
1  1000017                   3                 NaN                 NaN
2  1000023                   3                 NaN                 NaN

In [34]:
pd.pivot_table(df2, values=['Product_Category_1', 'Product_Category_2', 'Product_Category_3'], columns='User_ID')

User_ID,1000001,1000002,1000003,1000004,1000005,1000006,1000007,1000008,1000009,1000010,...,1006031,1006032,1006033,1006034,1006035,1006036,1006037,1006038,1006039,1006040
Product_Category_1,5.676471,4.394737,3.206897,1.000000,6.216981,5.500,1.875000,5.473684,5.877193,4.684685,...,6.400000,6.352941,2.714286,9.090909,5.062937,6.147059,7.637931,5.800000,5.701493,6.431953
Product_Category_2,6.285714,9.981481,5.086957,8.500000,11.068966,9.225,10.866667,10.730769,10.487805,8.455782,...,8.789474,9.833333,7.935484,12.900000,9.932039,10.695946,11.957143,10.333333,9.666667,11.030928
Product_Category_3,10.571429,13.807692,11.384615,14.111111,12.937500,11.600,15.000000,14.954545,12.933333,11.333333,...,12.000000,9.750000,12.555556,14.000000,12.857143,13.653465,13.843750,17.000000,11.916667,13.500000

In [ ]:
# pivot table

## Questão 11

Normalize a coluna Purchase. A fórmula de normalização é:


$$x_{norm} = \frac{x - x_{min}}{x_{max} - x_{min}} $$

In [22]:
df['Purchase_Normalizado'] = (df['Purchase'] - df['Purchase'].min()) / (df['Purchase'].max() - df['Purchase'].min())

In [26]:
df.head(3)

,User_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_ID,Purchase,Product_Category_1,Product_Category_2,Product_Category_3,Purchase_Normalizado
0,1000001,F,0-17,10,A,2,0,P00069042,8370,3,NaN,NaN,0.344255
1,1000017,M,51-55,1,C,0,0,P00069042,13591,3,NaN,NaN,0.563846
2,1000023,M,36-45,0,B,3,1,P00069042,11022,3,NaN,NaN,0.455796

## Questão 12
O estado civil influencia no valor gasto e na categoria de produto comprada? Mostre!

Se eu quisesse vender mais produtos da categoria 14, deveria investir em propagandas para qual estado civil?

In [78]:
ec = df.groupby(['Marital_Status'])

## Questão 13
Quais as variáveis que mais impactaram no valor da compra? Como você chegou a essa conclusão?